app/views/pages/home.haml

								#rendez-vous
									- if !doctor.time_slots.count.zero?
---
SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."doctor_id" = ?  [["doctor_id", 1]]
SELECT COUNT(*) FROM "time_slots" WHERE "time_slots"."doctor_id" = ?  [["doctor_id", 1]]