app/controllers/pages_controller.rb

SELECT "doctors".* FROM "doctors" WHERE (speciality LIKE '%dent%' AND postal_code LIKE ('["75", "77", "78", "91", "92", "93", "94", "95"]%'))
---
	def home
		@titre = "Accueil"
		if params[:speciality]
			region = REGIONS[params[:region]]
			@doctors = Doctor.where("speciality LIKE ? AND SUBSTR(postal_code, 1, 2) IN (?)", "#{params[:speciality]}%", region)