app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "nom", "prenom", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "prenom" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["prenom", "Youssef"], ["updated_at", Mon, 24 Mar 2014 17:30:16 UTC +00:00]]

  def take_rendez_vous
    @user = current_user
    @time_slot = TimeSlot.find(params[:time_slot_id])
    @user.rdvs.create time_slot: @time_slot
---
SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "rdvs" ("created_at", "time_slot_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 24 Mar 2014 19:23:42 UTC +00:00], ["time_slot_id", 1], ["updated_at", Mon, 24 Mar 2014 19:23:42 UTC +00:00], ["user_id", 7]]